In [1]:
import pandas as pd

# READING CSV FILES AND OBTAINING BASIC DATA ABOUT THE ROWS AND COLUMNS

In [17]:
df = pd.read_csv('task.csv')

In [4]:
df.shape

(21607, 8)

In [5]:
df.columns

Index(['id', 'date', 'price', 'bedrooms', 'bathrooms', 'sqft_living',
       'sqft_lot', 'floors'],
      dtype='object')

In [8]:
df.describe()

,id,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors
count,9.900000e+01,9.900000e+01,99.000000,99.000000,99.000000,99.000000,99.000000
mean,4.664620e+09,5.200763e+05,3.404040,1.989899,2086.383838,11478.818182,1.464646
std,2.935212e+09,3.061939e+05,0.794358,0.729236,864.592421,14655.249813,0.511363
min,1.600040e+07,1.530000e+05,2.000000,1.000000,770.000000,1044.000000,1.000000
25%,1.914950e+09,3.070000e+05,3.000000,1.500000,1410.000000,5000.000000,1.000000
50%,4.036801e+09,4.300000e+05,3.000000,2.000000,1900.000000,6720.000000,1.500000
75%,7.337325e+09,6.562500e+05,4.000000,2.500000,2570.000000,9823.000000,2.000000
max,9.822700e+09,2.000000e+06,5.000000,4.500000,5420.000000,101930.000000,3.000000

In [9]:
df.head()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors
0,7.129301e+09,20141013T000000,221900.0,3.0,1.00,1180.0,5650.0,1.0
1,6.414100e+09,20141209T000000,538000.0,3.0,2.25,2570.0,7242.0,2.0
2,5.631500e+09,20150225T000000,180000.0,2.0,1.00,770.0,10000.0,1.0
3,2.487201e+09,20141209T000000,604000.0,4.0,3.00,1960.0,5000.0,1.0
4,1.954401e+09,20150218T000000,510000.0,3.0,2.00,1680.0,8080.0,1.0

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21607 entries, 0 to 21606
Data columns (total 8 columns):
id             99 non-null float64
date           99 non-null object
price          99 non-null float64
bedrooms       99 non-null float64
bathrooms      99 non-null float64
sqft_living    99 non-null float64
sqft_lot       99 non-null float64
floors         99 non-null float64
dtypes: float64(7), object(1)
memory usage: 1.3+ MB

# DATA CLEANING

In [19]:
df.price.isnull().sum()   # checking the sum column for empty data as price of an apartment cant be empty

21508

In [20]:
df.price.mean()

520076.31313131313

In [21]:
price_mean = df.price.mean()
df.price.fillna(price_mean , inplace = True)  # replaces null values by mean price

In [22]:
df.price.isnull().sum()   # no null values in price

0

In [ ]:
# SIMILARLY WE REPLACE ALL NULL VALUES IN THE COLUMNS WHICH ARE IMPORTANT FOR THE MODEL .
# GIVING A MEAN VALUE TO EITHER ID OR DATE DOES NOT MAKE SENSE AND DOESNT BENIFIT THE MODEL .
# SO NULL VALUES IN ID / DATES WILL BE REPLACED BY 0 
# ALSO SINCE NUMBER OF BEDROOMS / BATHROOMS / FLOORS CANNOT BE IN DECIMALS , WE WILL USE ROUND FUNCTION AND ROUND THEM OFF TO INTEGERS

In [53]:
bed_mean = df.bedrooms.mean()
df.bedrooms.fillna(bed_mean , inplace = True)
df.bedrooms = df.bedrooms.round(0)

In [27]:
df.bathrooms.isnull().sum()

21508

In [50]:
bath_mean = df.bathrooms.mean()
df.bathrooms.fillna(bath_mean , inplace = True)
df.bathrooms = df.bathrooms.round(0)

In [30]:
df.bathrooms.isnull().sum()

0

In [31]:
df.sqft_living.isnull().sum()

21508

In [32]:
sq_l_mean = df.sqft_living.mean()
df.sqft_living.fillna(sq_l_mean , inplace = True)

In [33]:
df.sqft_living.isnull().sum()

0

In [35]:
df.sqft_lot.isnull().sum()

21508

In [36]:
sq_lot_mean = df.sqft_lot.mean()
df.sqft_lot.fillna(sq_lot_mean , inplace = True)

In [37]:
df.sqft_lot.isnull().sum()

0

In [38]:
df.floors.isnull().sum()

21508

In [54]:
floor_mean = df.floors.mean()
df.floors.fillna(floor_mean , inplace = True)
df.floors = df.floors.round(0)

In [40]:
df.floors.isnull().sum()

0

In [41]:
df.id.fillna(0 , inplace = True)
df.date.fillna(0 , inplace = True)

#  SOME MORE FUNCTIONS ON THE CLEANED DATA

In [43]:
df.price[df.floors == df.floors.max()]       # shows price of houses with max floors

31    280000.0
63    549000.0
Name: price, dtype: float64

In [45]:
df[['price' , 'floors']][df.sqft_living == df.sqft_living.max()]    # shows price and floors for houses with max sqft_living

       price  floors
5  1230000.0     1.0

In [46]:
df.loc[5]    # gives details of the row with index = 5

id                 7.23755e+09
date           20140512T000000
price                 1.23e+06
bedrooms                     4
bathrooms                  4.5
sqft_living               5420
sqft_lot                101930
floors                       1
Name: 5, dtype: object

In [55]:
df.floors.unique()   # gives the unique values stored in floors column

array([1., 2., 3.])

In [51]:
df.bathrooms.unique()   # gives the unique values stored in bathrooms column

array([1., 2., 3., 4.])

# ONE HOT ENCODING ON FLOORS

In [56]:
dummies = pd.get_dummies(df.floors)   # does one hot encoding and stores them in dummies

In [57]:
dummies

       1.0  2.0  3.0
0        1    0    0
1        0    1    0
2        1    0    0
3        1    0    0
4        1    0    0
...    ...  ...  ...
21602    1    0    0
21603    1    0    0
21604    1    0    0
21605    1    0    0
21606    1    0    0

[21607 rows x 3 columns]

In [59]:
df = pd.concat([df , dummies] , axis = 'columns')    # concatenates the two dataframes

In [60]:
df

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,1.0,2.0,3.0
0,7.129301e+09,20141013T000000,221900.000000,3.0,1.0,1180.000000,5650.000000,1.0,1,0,0
1,6.414100e+09,20141209T000000,538000.000000,3.0,2.0,2570.000000,7242.000000,2.0,0,1,0
2,5.631500e+09,20150225T000000,180000.000000,2.0,1.0,770.000000,10000.000000,1.0,1,0,0
3,2.487201e+09,20141209T000000,604000.000000,4.0,3.0,1960.000000,5000.000000,1.0,1,0,0
4,1.954401e+09,20150218T000000,510000.000000,3.0,2.0,1680.000000,8080.000000,1.0,1,0,0
...,...,...,...,...,...,...,...,...,...,...,...
21602,0.000000e+00,0,520076.313131,3.0,2.0,2086.383838,11478.818182,1.0,1,0,0
21603,0.000000e+00,0,520076.313131,3.0,2.0,2086.383838,11478.818182,1.0,1,0,0
21604,0.000000e+00,0,520076.313131,3.0,2.0,2086.383838,11478.818182,1.0,1,0,0
21605,0.000000e+00,0,520076.313131,3.0,2.0,2086.383838,11478.818182,1.0,1,0,0
21606,0.000000e+00,0,520076.313131,3.0,2.0,2086.383838,11478.818182,1.0,1,0,0

In [62]:
df = df.drop(['floors'] , axis = 'columns')    # floors column has been dropped as it is no longer required

In [63]:
df

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,1.0,2.0,3.0
0,7.129301e+09,20141013T000000,221900.000000,3.0,1.0,1180.000000,5650.000000,1,0,0
1,6.414100e+09,20141209T000000,538000.000000,3.0,2.0,2570.000000,7242.000000,0,1,0
2,5.631500e+09,20150225T000000,180000.000000,2.0,1.0,770.000000,10000.000000,1,0,0
3,2.487201e+09,20141209T000000,604000.000000,4.0,3.0,1960.000000,5000.000000,1,0,0
4,1.954401e+09,20150218T000000,510000.000000,3.0,2.0,1680.000000,8080.000000,1,0,0
...,...,...,...,...,...,...,...,...,...,...
21602,0.000000e+00,0,520076.313131,3.0,2.0,2086.383838,11478.818182,1,0,0
21603,0.000000e+00,0,520076.313131,3.0,2.0,2086.383838,11478.818182,1,0,0
21604,0.000000e+00,0,520076.313131,3.0,2.0,2086.383838,11478.818182,1,0,0
21605,0.000000e+00,0,520076.313131,3.0,2.0,2086.383838,11478.818182,1,0,0
21606,0.000000e+00,0,520076.313131,3.0,2.0,2086.383838,11478.818182,1,0,0

# DIVISION OF DATA INTO TRAIN SET AND TEST SET

In [64]:
df1 = df.copy()

In [65]:
train = df1.sample(frac = 0.80 , random_state = 1)
test = df1.drop(train.index)

In [67]:
train.shape

(17286, 10)

In [68]:
test.shape

(4321, 10)

# CONVERSION OF DATAFRAMES TO CSV FILES

In [69]:
df.to_csv('Cleaned_data.csv')

In [70]:
train.to_csv('Cleaned_Train_Data.csv')

In [71]:
test.to_csv('Cleaned_Test_Data.csv')